'''
Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.

*Пример:*

- [2, 3, 4, 5, 6] =>[12,15,16]      ([2*6, 3*5, 4*4]);
- [2, 3, 5, 6] => [12,15]   ( [2*6, 3*5])
'''
list = [2, 3, 4, 5, 6]
def multList(l):
    mult = []
    idx = 0
    while idx < (len(l) / 2):
        mult.append(l[idx] * l[len(l) - 1 -idx])
        idx = idx + 1
    return mult

print(multList(list))