'''

1. Сумма трех
Посчитайте сумму трех введенных целых чисел

2. Площадь
Пользователь вводит стороны прямоугольника, выведите его площадь

3. Периметр
Пользователь вводит стороны прямоугольника, выведите его периметр

'''
'1'
a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
c = int(input('Введите третье число: '))
sum = a + b + c
print(f' Сумма трёх чисел {sum}')

'2   3'
a = float(input('Введите длину: '))
b = float(input('Введите ширину: '))
s = a * b
p = 2 * (a + b)
print(f'S = {s}  P = {p}')


