'''
. Меньшее из двух
Пользователь вводит два целых числа. Выведите меньшее из них.

2. Четырехзначное?
Пользователь вводит целое число. Выведите YES, если это число является четырехзначным, и NO в противном случае.
'''

'''
'4'
a = int(input())
b = int(input())
if a < b:
    print(a)
elif a == b:
    print('Равны')  
else:
    print(b)
'''

    '5'
    a = int(input())
    if (a >= 1000 and a <= 9999):
        print('YES')
    else:
        print('NO')
        
